SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/protocol_config/efr32xg23/ieee802154_efr32xg23_configurator_out.c
const RAIL_ChannelConfigEntry_t ieee802154_gb868_863_channels[] = {
  {
    .phyConfigDeltaAdd = NULL,
    .baseFrequency = 863250000,
    .channelSpacing = 200000,
    .physicalChannelOffset = 128,
    .channelNumberStart = 128,
    .channelNumberEnd = 154,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = NULL,
    .baseFrequency = 863250000,
    .channelSpacing = 200000,
    .physicalChannelOffset = 133,
    .channelNumberStart = 160,
    .channelNumberEnd = 167,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = NULL,
    .baseFrequency = 863250000,
    .channelSpacing = 200000,
    .physicalChannelOffset = 106,
    .channelNumberStart = 168,
    .channelNumberEnd = 168,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = NULL,
    .baseFrequency = 863250000,
    .channelSpacing = 200000,
    .physicalChannelOffset = 157,
    .channelNumberStart = 192,
    .channelNumberEnd = 218,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t ieee802154_gb868_915_channels[] = {
  {
    .phyConfigDeltaAdd = NULL,
    .baseFrequency = 915350000,
    .channelSpacing = 200000,
    .physicalChannelOffset = 224,
    .channelNumberStart = 224,
    .channelNumberEnd = 250,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_1,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfig_t ieee802154_gb868_863_channelConfig = {
  .phyConfigBase = ieee802154_gb868_863_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = ieee802154_gb868_863_channels,
  .length = 4U,
  .signature = 0UL,
  .xtalFrequencyHz = 38400000UL,
};

const RAIL_ChannelConfig_t ieee802154_gb868_915_channelConfig = {
  .phyConfigBase = ieee802154_gb868_915_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = ieee802154_gb868_915_channels,
  .length = 1U,
  .signature = 0UL,
  .xtalFrequencyHz = 38400000UL,
};

uint32_t ieee802154AccelerationBuffer[471];
